> compare(factor("a"), 1L)
`old` is an S3 object of class <factor>, an integer vector
`new` is an integer vector (1)

> compare(factor("a"), globalenv())
`old` is an S3 object of class <factor>, an integer vector
`new` is an environment

> compare(factor("a"), as.Date("1970-01-02"))
`old` is an S3 object of class <factor>, an integer vector
`new` is an S3 object of class <Date>, a double vector

> compare(structure(function() { }, class = "foo"), factor("a"))
`old` is an S3 object of class <foo>, a function
`new` is an S3 object of class <factor>, an integer vector

